soap-query-examples/UpdateDocIndexes_ModifyIndexes.xml

<!--  Ne fonctionne pas  -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:cyp="http://asg.com/cypress_wcfsvc_v73/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header/>
  <soapenv:Body>
     <cyp:ModifyDocIndexes>
		<!--Optional:-->
		<cyp:UserCredential>
			<cyp:CredentialType>UserIdPassword</cyp:CredentialType>
			<cyp:DomainName>molitor</cyp:DomainName>
			<cyp:UserName>srv_bdoc</cyp:UserName>
			<cyp:Password>28awuS+eBrEm</cyp:Password>
			<cyp:CypWsUserId/>
			<cyp:CredentialData/>
		</cyp:UserCredential>
        
        <cyp:ReqModifyDocInx>
         <cyp:ModifyActnList xsi:type="cyp:CwsModifyIndexActn">
          <cyp:CwsModifyIndexActn>
          <cyp:UseTempToCvtVals>false</cyp:UseTempToCvtVals>
          <cyp:UpdtScope>DocLevelUpdate</cyp:UpdtScope>
          <cyp:InxList>
            <cyp:CwsMdfyInxVal>
              <cyp:InxId>1026</cyp:InxId>
              <cyp:CurVal xsi:type="xsd:string">OUT</cyp:CurVal>
              <cyp:NewVal xsi:type="xsd:string">TOTO</cyp:NewVal>
            </cyp:CwsMdfyInxVal>
         </cyp:InxList>
         <cyp:TgtDocs>
             <cyp:DdocIds>
             <cyp:unsignedInt>23680</cyp:unsignedInt>
             </cyp:DdocIds>
         </cyp:TgtDocs>
         </cyp:CwsModifyIndexActn>
         
        </cyp:ModifyActnList>
       </cyp:ReqModifyDocInx>
      </cyp:ModifyDocIndexes>
  </soapenv:Body>
</soapenv:Envelope>
